<a href="https://colab.research.google.com/github/sandeep92134/PACKT-python-workshop/blob/main/module%2010/Exercise_135_Computing_DataFrames_within_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In this exercise, you will use the same **test score** data and perform more computations on the DataFrame. The following steps will enable you to complete the exercise:

1. Open a new Jupyter Notebook.
2. Import **pandas** as **pd** and enter the student value as shown in Exercise 134, DataFrame Computations with the Student testscore Data. After this, convert it to a DataFrame:
3. Now, begin by arranging the rows of the DataFrame, as shown in the following code snippet. You can use the same bracket notation, **[ ]**, for rows as for lists and strings:
4. Transpose the DataFrame:
5. Now, rename the columns to **Quiz_1**, **Quiz_2**, and **Quiz_3**, which was covered in Exercise 134, DataFrame Computations with the Student testscore Data:
6. Now, define a new **DataFrame** from the first two rows and the last two columns. You can choose the rows and columns by name first.
7. Now, select the first two rows and the last two columns using index numbers. You can use **.iloc** to select rows and columns by index.
8. Now, create a new column as the mean.
9. Create a new column as a list.
10. Now, delete the **Quiz_Avg** column as it is not needed anymore:

In [1]:
import pandas as pd
# Create dictionary of test scores
test_dict = {'Corey':[63,75,88], 'Kevin':[48,98,92], 'Akshay': [87, 86, 85]}
# Create DataFrame
df = pd.DataFrame(test_dict)
# Limit DataFrame to first 2 rows
df[0:2]

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86

In [2]:
df = df.T
df

         0   1   2
Corey   63  75  88
Kevin   48  98  92
Akshay  87  86  85

In [3]:
# Rename Columns
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3']
df

        Quiz_1  Quiz_2  Quiz_3
Corey       63      75      88
Kevin       48      98      92
Akshay      87      86      85

In [4]:
# Defining a new DataFrame from first 2 rows and last 2 columns 
rows = ['Corey', 'Kevin']
cols = ['Quiz_2', 'Quiz_3']
df_spring = df.loc[rows, cols]
df_spring

       Quiz_2  Quiz_3
Corey      75      88
Kevin      98      92

In [5]:
# Select first 2 rows and last 2 columns using index numbers 
df.iloc[[0,1], [1,2]]

       Quiz_2  Quiz_3
Corey      75      88
Kevin      98      92

In [6]:
# Select first 2 rows and last 2 columns using index numbers 
df.iloc[0:2, 1:3]

       Quiz_2  Quiz_3
Corey      75      88
Kevin      98      92

In [7]:
# Define new column as mean of other columns
df['Quiz_Avg'] = df.mean(axis=1)
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg
Corey       63      75      88  75.333333
Kevin       48      98      92  79.333333
Akshay      87      86      85  86.000000

In [8]:
df['Quiz_4'] = [92, 95, 88]
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg  Quiz_4
Corey       63      75      88  75.333333      92
Kevin       48      98      92  79.333333      95
Akshay      87      86      85  86.000000      88

In [9]:
del df['Quiz_Avg']
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Corey       63      75      88      92
Kevin       48      98      92      95
Akshay      87      86      85      88